-- phpMyAdmin SQL Dump
-- version 4.7.0
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Dec 05, 2017 at 01:18 PM
-- Server version: 10.1.22-MariaDB
-- PHP Version: 7.1.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `attendancedb`
--
/*CREATE DATABASE IF NOT EXISTS `attendancedb` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `attendancedb`;*/

-- --------------------------------------------------------

--
-- Table structure for table `classes`
--

CREATE TABLE `classes` (
  `class_id` int(11) NOT NULL,
  `class_code` varchar(15) NOT NULL,
  `class_name` varchar(50) NOT NULL,
  `date` date NOT NULL,
  `hours_num` int(11) NOT NULL,
  `topic` text NOT NULL,
  `homework` text NOT NULL,
  `comments` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `classes`
--

INSERT INTO `classes` (`class_id`, `class_code`, `class_name`, `date`, `hours_num`, `topic`, `homework`, `comments`) VALUES
(1, '7109-6', 'בסיסי נתונים וארגון קבצים', '2017-08-01', 2, '', '', '');

-- --------------------------------------------------------

--
-- Table structure for table `classes_timetables`
--

CREATE TABLE `classes_timetables` (
  `timetable_id` int(11) NOT NULL,
  `class_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `students`
--

CREATE TABLE `students` (
  `student_id` int(11) NOT NULL,
  `student_group` varchar(25) NOT NULL,
  `first_name` varchar(50) NOT NULL,
  `last_name` varchar(50) NOT NULL,
  `attendance` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `students`
--

INSERT INTO `students` (`student_id`, `student_group`, `first_name`, `last_name`, `attendance`) VALUES
(12345678, 'חשמל 54/5', 'אושאדי', 'עידן משה', 0),
(123456781, 'חשמל 54/5', 'אטיאס', 'אל-עד', 0),
(123456782, 'חשמל 54/5', 'פטרוב', 'אנדריי', 0),
(123456783, 'מחשבים 41/5 משולב', 'וקנין', 'ליאב', 0),
(123456784, 'מחשבים 41/5 משולב', 'עואודה', 'תאמר', 0),
(123456785, 'מחשבים 41/5 משולב', 'שקורי', 'אור', 0),
(123456786, 'אלקטרוניקה 53/5 משולב', 'ליניק', 'ארתיום', 0),
(1234567810, 'חשמל 54/5', 'עבוד', 'וסים', 0),
(1234567811, 'חשמל 54/5', 'אטייס', 'אברהם', 0),
(1234567812, 'חשמל 54/5', 'בוטא', 'סרגיי', 0),
(1234567813, 'חשמל 54/5', 'בן אלי', 'יחיאל', 0),
(1234567814, 'חשמל 54/5', 'דרעי', 'עידן', 0),
(1234567815, 'חשמל 54/5', 'חיימוביץ', 'שמואל', 0),
(1234567816, 'חשמל 54/5', 'חיימוביץ', 'זאב', 0),
(1234567817, 'חשמל 54/5', 'יאיר', 'אפי', 0),
(1234567818, 'חשמל 54/5', 'מיאגקוב', 'דניס', 0),
(1234567819, 'חשמל 54/5', 'סיבוני', 'דוד', 0),
(1234567821, 'חשמל 54/5', 'קדוש', 'אלעד', 0),
(1234567822, 'חשמל 54/5', 'קזז', 'אורן', 0),
(1234567823, 'חשמל 54/5', 'גרינברג', 'איתי', 0),
(1234567824, 'חשמל 54/5', 'פנקרטוב', 'ויטלי', 0),
(1234567825, 'מחשבים 41/5 משולב', 'אבן', 'תמיר', 0),
(1234567826, 'מחשבים 41/5 משולב', 'אליאב', 'שובל', 0),
(1234567827, 'מחשבים 41/5 משולב', 'בוקאעי', 'נדים', 0),
(1234567828, 'מחשבים 41/5 משולב', 'בנדיטקיס', 'אלכסנדר', 0),
(1234567829, 'מחשבים 41/5 משולב', 'גריפאת', 'פהד', 0),
(1234567831, 'מחשבים 41/5 משולב', 'וקשטיין', 'ז\'נה', 0),
(1234567832, 'מחשבים 41/5 משולב', 'חלבי', 'אדהם', 0),
(1234567833, 'מחשבים 41/5 משולב', 'טרסוב', 'סטניסלב', 0),
(1234567834, 'מחשבים 41/5 משולב', 'לובציובה', 'רונן', 0),
(1234567835, 'מחשבים 41/5 משולב', 'לריח', 'אסף', 0),
(1234567836, 'מחשבים 41/5 משולב', 'מלאק', 'כילוד', 0),
(1234567837, 'מחשבים 41/5 משולב', 'מרקו', 'דור', 0),
(1234567838, 'מחשבים 41/5 משולב', 'ניידיונקוב', 'אלכסנדר', 0),
(1234567839, 'מחשבים 41/5 משולב', 'סעיד', 'עמיר', 0),
(1234567840, 'מחשבים 41/5 משולב', 'שפינדל', 'ניר', 0),
(1234567841, 'מחשבים 41/5 משולב', 'פז', 'רות', 0),
(1234567842, 'מחשבים 41/5 משולב', 'פינקל', 'רוני בנימין', 0),
(1234567843, 'מחשבים 41/5 משולב', 'פיפקו', 'סרגיי', 0),
(1234567844, 'מחשבים 41/5 משולב', 'קאופמן', 'יותם', 0),
(1234567845, 'מחשבים 41/5 משולב', 'קומלב', 'ויקטור', 0),
(1234567846, 'מחשבים 41/5 משולב', 'קרסני', 'אלכסיי', 0),
(1234567847, 'מחשבים 41/5 משולב', 'רופלט', 'מקסים', 0),
(1234567848, 'מחשבים 41/5 משולב', 'שיגול', 'אוקסנה', 0),
(1234567849, 'מחשבים 41/5 משולב', 'שילה', 'מור', 0),
(1234567850, 'אלקטרוניקה 53/5 משולב', 'לופוביץ', 'קובי', 0),
(1234567851, 'אלקטרוניקה 53/5 משולב', 'איגוס', 'יהודה', 0),
(1234567852, 'אלקטרוניקה 53/5 משולב', 'אלקובי', 'עומר', 0),
(1234567853, 'אלקטרוניקה 53/5 משולב', 'גלקין', 'אנדרי', 0),
(1234567854, 'אלקטרוניקה 53/5 משולב', 'דהאן', 'יוסף', 0),
(1234567855, 'אלקטרוניקה 53/5 משולב', 'דל', 'ארטיום', 0),
(1234567856, 'אלקטרוניקה 53/5 משולב', 'טייב', 'בן', 0),
(1234567857, 'אלקטרוניקה 53/5 משולב', 'יהב', 'טל', 0),
(1234567858, 'אלקטרוניקה 53/5 משולב', 'ירשוב', 'קסניה', 0),
(1234567859, 'אלקטרוניקה 53/5 משולב', 'לוי', 'ולדיסלב', 0),
(1234567861, 'אלקטרוניקה 53/5 משולב', 'לנצמן', 'ברל', 0),
(1234567862, 'אלקטרוניקה 53/5 משולב', 'מטיושקו', 'מקסים', 0),
(1234567863, 'אלקטרוניקה 53/5 משולב', 'מנדל', 'רן', 0),
(1234567864, 'אלקטרוניקה 53/5 משולב', 'סלמן', 'גל', 0),
(1234567865, 'אלקטרוניקה 53/5 משולב', 'פרץ', 'טום ישראל', 0),
(1234567866, 'אלקטרוניקה 53/5 משולב', 'קלוגה', 'ישי', 0),
(1234567867, 'אלקטרוניקה 53/5 משולב', 'קריטנברג', 'נדב', 0),
(1234567868, 'אלקטרוניקה 53/5 משולב', 'שרלי', 'יניב', 0);

-- --------------------------------------------------------

--
-- Table structure for table `students_classes`
--

CREATE TABLE `students_classes` (
  `student_id` int(11) NOT NULL,
  `class_id` int(11) NOT NULL,
  `attended` tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `students_classes`
--

INSERT INTO `students_classes` (`student_id`, `class_id`, `attended`) VALUES
(1234567825, 1, 0);

-- --------------------------------------------------------

--
-- Table structure for table `students_timetables`
--

CREATE TABLE `students_timetables` (
  `student_id` int(11) NOT NULL,
  `timetable_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `timetables`
--

CREATE TABLE `timetables` (
  `timetable_id` int(11) NOT NULL,
  `course_code` varchar(15) NOT NULL,
  `course_name` varchar(255) NOT NULL,
  `semester` varchar(25) NOT NULL,
  `teacher_name` varchar(50) NOT NULL,
  `student_group` varchar(25) NOT NULL,
  `timeofday` varchar(15) NOT NULL,
  `dayofweek` varchar(10) NOT NULL,
  `hours_total` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `timetables`
--

INSERT INTO `timetables` (`timetable_id`, `course_code`, `course_name`, `semester`, `teacher_name`, `student_group`, `timeofday`, `dayofweek`, `hours_total`) VALUES
(1, '7101-1380', 'אנגלית טכנית', 'סמסטר א\'', 'אמדור אינה', 'מחשבים 42/1', '12:00-14:10', 'Wednesday', 48),
(2, '7101-1380', 'אנגלית טכנית', 'סמסטר א\'', ' בראשטר מרלנה', 'מחשבים 42/1', '12:00-14:10', 'Wednesday', 48),
(3, '7101-1380', 'אנגלית טכנית', 'סמסטר א\'', ' פלג דוריס', 'מחשבים 42/1', '12:00-14:10', 'Wednesday', 48),
(4, '7101-1400', 'אנגלית טכנית', 'סמסטר א\'', 'אמדור אינה', 'מחשבים 42/3', '11:50-14:10', 'Wednesday', 48),
(5, '7101-1400', 'אנגלית טכנית', 'סמסטר א\'', ' בראשטר מרלנה', 'מחשבים 42/3', '11:50-14:10', 'Wednesday', 48),
(6, '7101-1400', 'אנגלית טכנית', 'סמסטר א\'', ' פלג דוריס', 'מחשבים 42/3', '11:50-14:10', 'Wednesday', 48),
(7, '7101-8', 'אנגלית טכנית', 'סמסטר א\'', 'אמדור אינה', 'מחשבים 42/2', '11:50-14:10', 'Wednesday', 48),
(8, '7101-8', 'אנגלית טכנית', 'סמסטר א\'', ' בראשטר מרלנה', 'מחשבים 42/2', '11:50-14:10', 'Wednesday', 48),
(9, '7101-8', 'אנגלית טכנית', 'סמסטר א\'', ' פלג דוריס', 'מחשבים 42/2', '11:50-14:10', 'Wednesday', 48),
(10, '7102-5', 'מתמטיקה', 'סמסטר א\'', 'גרינברג יהודית', 'מחשבים 42/2', '11:00-12:35', 'Sunday', 48),
(11, '7102-5', 'מתמטיקה', 'סמסטר א\'', 'גרינברג יהודית', 'מחשבים 42/2', '15:10-16:00', 'Tuesday', 48),
(12, '7102-850', 'מתמטיקה', 'סמסטר א\'', 'גרינברג יהודית', 'מחשבים 42/1', '14:20-16:00', 'Sunday', 48),
(13, '7102-850', 'מתמטיקה', 'סמסטר א\'', 'גרינברג יהודית', 'מחשבים 42/1', '12:35-13:20', 'Monday', 48),
(14, '7102-860', 'מתמטיקה', 'סמסטר א\'', 'רויטמן אריאל', 'מחשבים 42/5 משולב', '12:15-13:45', 'Friday', 32),
(15, '7102-880', 'מתמטיקה', 'סמסטר א\'', 'בירמן לריסה', 'מחשבים 42/3', '12:35-13:20', 'Sunday', 48),
(16, '7102-880', 'מתמטיקה', 'סמסטר א\'', 'בירמן לריסה', 'מחשבים 42/3', '14:20-16:00', 'Wednesday', 48),
(17, '7103-1390', 'אלגברה לינארית', 'סמסטר א\'', 'גרינברג יהודית', 'מחשבים 42/1', '13:25-14:10', 'Sunday', 64),
(18, '7103-1390', 'אלגברה לינארית', 'סמסטר א\'', 'גרינברג יהודית', 'מחשבים 42/1', '11:00-11:50', 'Monday', 64),
(19, '7103-1390', 'אלגברה לינארית', 'סמסטר א\'', 'גרינברג יהודית', 'מחשבים 42/1', '09:00-10:50', 'Wednesday', 64),
(20, '7103-1400', 'אלגברה לינארית', 'סמסטר א\'', 'רויטמן אריאל', 'מחשבים 42/5 משולב', '09:40-12:10', 'Friday', 48),
(21, '7103-1420', 'אלגברה לינארית', 'סמסטר א\'', 'בירמן לריסה', 'מחשבים 42/3', '13:25-14:10', 'Sunday', 64),
(22, '7103-1420', 'אלגברה לינארית', 'סמסטר א\'', 'בירמן לריסה', 'מחשבים 42/3', '13:25-16:10', 'Monday', 64),
(23, '7103-7', 'אלגברה לינארית', 'סמסטר א\'', 'גרינברג יהודית', 'מחשבים 42/2', '12:35-13:20', 'Sunday', 64),
(24, '7103-7', 'אלגברה לינארית', 'סמסטר א\'', 'גרינברג יהודית', 'מחשבים 42/2', '10:00-10:50', 'Monday', 64),
(25, '7103-7', 'אלגברה לינארית', 'סמסטר א\'', 'גרינברג יהודית', 'מחשבים 42/2', '13:25-15:05', 'Tuesday', 64),
(26, '7104-1260', 'אלגברה בוליאנית', 'סמסטר א\'', 'לוי אורית', 'מחשבים 42/1', '08:10-09:00', 'Tuesday', 64),
(27, '7104-1260', 'אלגברה בוליאנית', 'סמסטר א\'', 'לוי אורית', 'מחשבים 42/1', '10:00-11:50', 'Thursday', 64),
(28, '7104-1270', 'אלגברה בוליאנית', 'סמסטר א\'', 'גרייב חביב', 'מחשבים 42/5 משולב', '17:00-21:10', 'Monday', 80),
(29, '7104-1290', 'אלגברה בוליאנית', 'סמסטר א\'', 'לוי אורית', 'מחשבים 42/3', '12:35-15:05', 'Tuesday', 64),
(30, '7104-1290', 'אלגברה בוליאנית', 'סמסטר א\'', 'לוי אורית', 'מחשבים 42/3', '14:20-15:05', 'Thursday', 64),
(31, '7104-6', 'אלגברה בוליאנית', 'סמסטר א\'', 'לוי אורית', 'מחשבים 42/2', '11:00-12:35', 'Monday', 64),
(32, '7104-6', 'אלגברה בוליאנית', 'סמסטר א\'', 'לוי אורית', 'מחשבים 42/2', '15:10-16:00', 'Monday', 64),
(33, '7105-1340', 'סטטיסטיקה', 'סמסטר א\'', 'ברנובסקיה אינה', 'מחשבים 42/1', '11:00-11:50', 'Wednesday', 32),
(34, '7105-1340', 'סטטיסטיקה', 'סמסטר א\'', 'ברנובסקיה אינה', 'מחשבים 42/1', '15:10-16:00', 'Wednesday', 32),
(35, '7105-1360', 'סטטיסטיקה', 'סמסטר א\'', 'ברנובסקיה אינה', 'מחשבים 42/3', '09:00-10:50', 'Monday', 32),
(36, '7105-32631', 'סטטיסטיקה', 'סמסטר א\'', 'ברנובסקיה אינה', 'מחשבים 41/5 משולב', '17:00-18:35', 'Monday', 32),
(37, '7105-8', 'סטטיסטיקה', 'סמסטר א\'', 'ברנובסקיה אינה', 'מחשבים 42/2', '12:35-14:10', 'Monday', 32),
(38, '7107-5', 'מבנה וארגון המחשב', 'סמסטר א\'', 'יצחק אלחנן', 'מחשבים 42/2', '16:10-18:35', 'Monday', 48),
(39, '7107-830', 'מבנה וארגון המחשב', 'סמסטר א\'', 'יצחק אלחנן', 'מחשבים 42/1', '16:10-18:35', 'Sunday', 48),
(40, '7107-840', 'מבנה וארגון המחשב', 'סמסטר א\'', 'יצחק אלחנן', 'מחשבים 42/5 משולב', '19:35-21:10', 'Wednesday', 32),
(41, '7107-860', 'מבנה וארגון המחשב', 'סמסטר א\'', 'יצחק אלחנן', 'מחשבים 42/3', '15:10-17:45', 'Thursday', 48),
(42, '7109-6', 'בסיסי נתונים וארגון קבצים', 'סמסטר א\'', 'צ\'רנומז יבגניה', 'מחשבים 41/5 משולב', '19:35-21:10', 'Wednesday', 32),
(43, '7109-600', 'בסיסי נתונים וארגון קבצים', 'סמסטר א\'', 'קוליש אנטון', 'מחשבים 41/1', '09:00-10:50', 'Wednesday', 32),
(44, '7109-610', 'בסיסי נתונים וארגון קבצים', 'סמסטר א\'', 'קוליש אנטון', 'מחשבים 41/2', '12:35-14:10', 'Wednesday', 32),
(45, '7109-764', 'בסיסי נתונים וארגון קבצים', 'סמסטר א\'', 'קוליש אנטון', 'מחשבים 41/3', '11:00-12:35', 'Wednesday', 32),
(46, '7113-1000', 'שפת C', 'סמסטר א\'', 'דנדן סמאר', 'מחשבים 42/5 משולב', '17:00-19:30', 'Wednesday', 48),
(47, '7113-1010', 'שפת C', 'סמסטר א\'', 'צ\'רנומז יבגניה', 'מחשבים 41/5 משולב', '19:35-21:10', 'Monday', 112),
(48, '7113-1010', 'שפת C', 'סמסטר א\'', 'צ\'רנומז יבגניה', 'מחשבים 41/5 משולב', '18:45-19:30', 'Monday', 112),
(49, '7113-1010', 'שפת C', 'סמסטר א\'', 'צ\'רנומז יבגניה', 'מחשבים 41/5 משולב', '18:45-19:30', 'Tuesday', 112),
(50, '7113-1010', 'שפת C', 'סמסטר א\'', 'צ\'רנומז יבגניה', 'מחשבים 41/5 משולב', '11:25-12:10', 'Friday', 112),
(51, '7113-1010', 'שפת C', 'סמסטר א\'', 'צ\'רנומז יבגניה', 'מחשבים 41/5 משולב', '12:15-13:45', 'Friday', 112),
(52, '7113-1010', 'שפת C', 'סמסטר א\'', ' קוליש אנטון', 'מחשבים 41/5 משולב', '19:35-21:10', 'Monday', 112),
(53, '7113-1010', 'שפת C', 'סמסטר א\'', ' קוליש אנטון', 'מחשבים 41/5 משולב', '18:45-19:30', 'Monday', 112),
(54, '7113-1010', 'שפת C', 'סמסטר א\'', ' קוליש אנטון', 'מחשבים 41/5 משולב', '18:45-19:30', 'Tuesday', 112),
(55, '7113-1010', 'שפת C', 'סמסטר א\'', ' קוליש אנטון', 'מחשבים 41/5 משולב', '11:25-12:10', 'Friday', 112),
(56, '7113-1010', 'שפת C', 'סמסטר א\'', ' קוליש אנטון', 'מחשבים 41/5 משולב', '12:15-13:45', 'Friday', 112),
(57, '7113-1030', 'שפת C', 'סמסטר א\'', 'דנדן סמאר', 'מחשבים 42/3', '11:00-12:35', 'Monday', 144),
(58, '7113-1030', 'שפת C', 'סמסטר א\'', 'דנדן סמאר', 'מחשבים 42/3', '08:10-09:50', 'Tuesday', 144),
(59, '7113-1030', 'שפת C', 'סמסטר א\'', 'דנדן סמאר', 'מחשבים 42/3', '08:10-09:50', 'Wednesday', 144),
(60, '7113-1030', 'שפת C', 'סמסטר א\'', 'דנדן סמאר', 'מחשבים 42/3', '10:00-11:50', 'Wednesday', 144),
(61, '7113-1030', 'שפת C', 'סמסטר א\'', 'דנדן סמאר', 'מחשבים 42/3', '12:35-14:10', 'Thursday', 144),
(62, '7113-1030', 'שפת C', 'סמסטר א\'', ' קול שלי', 'מחשבים 42/3', '11:00-12:35', 'Monday', 144),
(63, '7113-1030', 'שפת C', 'סמסטר א\'', ' קול שלי', 'מחשבים 42/3', '08:10-09:50', 'Tuesday', 144),
(64, '7113-1030', 'שפת C', 'סמסטר א\'', ' קול שלי', 'מחשבים 42/3', '08:10-09:50', 'Wednesday', 144),
(65, '7113-1030', 'שפת C', 'סמסטר א\'', ' קול שלי', 'מחשבים 42/3', '10:00-11:50', 'Wednesday', 144),
(66, '7113-1030', 'שפת C', 'סמסטר א\'', ' קול שלי', 'מחשבים 42/3', '12:35-14:10', 'Thursday', 144),
(67, '7113-7', 'שפת C', 'סמסטר א\'', 'דנדן סמאר', 'מחשבים 42/2', '13:25-16:00', 'Sunday', 144),
(68, '7113-7', 'שפת C', 'סמסטר א\'', 'דנדן סמאר', 'מחשבים 42/2', '14:20-16:00', 'Wednesday', 144),
(69, '7113-7', 'שפת C', 'סמסטר א\'', 'דנדן סמאר', 'מחשבים 42/2', '11:50-13:20', 'Thursday', 144),
(70, '7113-7', 'שפת C', 'סמסטר א\'', 'דנדן סמאר', 'מחשבים 42/2', '10:00-11:50', 'Thursday', 144),
(71, '7113-7', 'שפת C', 'סמסטר א\'', ' לבילב אירנה', 'מחשבים 42/2', '13:25-16:00', 'Sunday', 144),
(72, '7113-7', 'שפת C', 'סמסטר א\'', ' לבילב אירנה', 'מחשבים 42/2', '14:20-16:00', 'Wednesday', 144),
(73, '7113-7', 'שפת C', 'סמסטר א\'', ' לבילב אירנה', 'מחשבים 42/2', '11:50-13:20', 'Thursday', 144),
(74, '7113-7', 'שפת C', 'סמסטר א\'', ' לבילב אירנה', 'מחשבים 42/2', '10:00-11:50', 'Thursday', 144),
(75, '7113-990', 'שפת C', 'סמסטר א\'', 'דנדן סמאר', 'מחשבים 42/1', '09:00-10:50', 'Monday', 144),
(76, '7113-990', 'שפת C', 'סמסטר א\'', 'דנדן סמאר', 'מחשבים 42/1', '13:25-15:05', 'Monday', 144),
(77, '7113-990', 'שפת C', 'סמסטר א\'', 'דנדן סמאר', 'מחשבים 42/1', '09:00-11:50', 'Tuesday', 144),
(78, '7113-990', 'שפת C', 'סמסטר א\'', 'דנדן סמאר', 'מחשבים 42/1', '08:10-09:50', 'Thursday', 144),
(79, '7113-990', 'שפת C', 'סמסטר א\'', 'דנדן סמאר', 'מחשבים 42/1', '12:35-13:20', 'Thursday', 144),
(80, '7113-990', 'שפת C', 'סמסטר א\'', ' לוי אורית', 'מחשבים 42/1', '09:00-10:50', 'Monday', 144),
(81, '7113-990', 'שפת C', 'סמסטר א\'', ' לוי אורית', 'מחשבים 42/1', '13:25-15:05', 'Monday', 144),
(82, '7113-990', 'שפת C', 'סמסטר א\'', ' לוי אורית', 'מחשבים 42/1', '09:00-11:50', 'Tuesday', 144),
(83, '7113-990', 'שפת C', 'סמסטר א\'', ' לוי אורית', 'מחשבים 42/1', '08:10-09:50', 'Thursday', 144),
(84, '7113-990', 'שפת C', 'סמסטר א\'', ' לוי אורית', 'מחשבים 42/1', '12:35-13:20', 'Thursday', 144),
(85, '7118-1010', 'מערכות הפעלה', 'סמסטר א\'', 'להב רון', 'מחשבים 41/1', '08:10-09:50', 'Sunday', 48),
(86, '7118-1020', 'מערכות הפעלה', 'סמסטר א\'', 'להב רון', 'מחשבים 41/2', '10:00-11:50', 'Sunday', 32),
(87, '7118-2', 'מערכות הפעלה', 'סמסטר א\'', 'להב רון', 'מחשבים 40/5', '19:35-21:10', 'Monday', 32),
(88, '7118-3', 'מערכות הפעלה', 'סמסטר א\'', 'להב רון', 'מחשבים 41/3', '10:00-11:50', 'Sunday', 32),
(89, '7120-12', 'מבנה נתונים', 'סמסטר א\'', 'צ\'רנומז יבגניה', 'מחשבים 40/5', '17:00-19:30', 'Wednesday', 48),
(90, '7120-1340', 'מבנה נתונים', 'סמסטר א\'', 'לבילב אירנה', 'מחשבים 41/1', '11:00-13:00', 'Tuesday', 48),
(91, '7120-1350', 'מבנה נתונים', 'סמסטר א\'', 'לבילב אירנה', 'מחשבים 41/2', '13:25-16:00', 'Monday', 48),
(92, '7120-1360', 'מבנה נתונים', 'סמסטר א\'', 'צ\'רנומז יבגניה', 'מחשבים 41/5 משולב', '17:00-18:35', 'Tuesday', 32),
(93, '7120-15', 'מבנה נתונים', 'סמסטר א\'', 'לבילב אירנה', 'מחשבים 41/3', '13:25-16:00', 'Monday', 96),
(94, '7120-15', 'מבנה נתונים', 'סמסטר א\'', 'לבילב אירנה', 'מחשבים 41/3', '11:00-13:00', 'Tuesday', 96),
(95, '7122-10', 'מערכות תקשורת', 'סמסטר א\'', 'גרייב חביב', 'מחשבים 40/5', '19:35-21:10', 'Wednesday', 32),
(96, '7122-1290', 'מערכות תקשורת', 'סמסטר א\'', 'גרייב חביב', 'מחשבים 41/1', '10:00-12:35', 'Thursday', 48),
(97, '7122-1300', 'מערכות תקשורת', 'סמסטר א\'', 'גרייב חביב', 'מחשבים 41/2', '13:25-16:00', 'Thursday', 48),
(98, '7122-32476', 'מערכות תקשורת', 'סמסטר א\'', 'גרייב חביב', 'מחשבים 41/3', '10:00-12:35', 'Thursday', 48),
(99, '7127-2', 'הכנה לפרוייקט', 'סמסטר א\'', 'צ\'רנומז יבגניה', 'מחשבים 41/1', '13:25-14:10', 'Monday', 16),
(100, '7127-3', 'הכנה לפרוייקט', 'סמסטר א\'', 'צ\'רנומז יבגניה', 'מחשבים 41/2', '12:35-13:25', 'Thursday', 16),
(101, '7127-32477', 'הכנה לפרוייקט', 'סמסטר א\'', 'צ\'רנומז יבגניה', 'מחשבים 41/3', '16:10-17:00', 'Thursday', 16),
(102, '7127-32839', 'הכנה לפרוייקט', 'סמסטר א\'', 'צ\'רנומז יבגניה', 'מחשבים 40/5', '09:40-10:25', 'Friday', 16),
(103, '7130-1450', 'שפת אסמבלר', 'סמסטר א\'', 'קול שלי', 'מחשבים 41/1', '08:10-10:50', 'Monday', 48),
(104, '7130-1460', 'שפת אסמבלר', 'סמסטר א\'', 'יצחק אלחנן', 'מחשבים 41/2', '16:10-18:35', 'Tuesday', 48),
(105, '7130-1470', 'שפת אסמבלר', 'סמסטר א\'', 'יצחק אלחנן', 'מחשבים 41/5 משולב', '17:00-19:30', 'Wednesday', 48),
(106, '7130-32478', 'שפת אסמבלר', 'סמסטר א\'', 'קול שלי', 'מחשבים 41/3', '08:10-10:50', 'Monday', 64),
(107, '7134-501', 'ניתוח מערכות מידע', 'סמסטר א\'', 'צ\'רנומז יבגניה', 'מחשבים 40/5', '08:00-09:30', 'Friday', 32),
(108, '7137-170', 'מעבדה אסמבלר', 'סמסטר א\'', 'דנדן סמאר', 'מחשבים 41/1', '11:00-12:35', 'Monday', 32),
(109, '7137-180', 'מעבדה אסמבלר', 'סמסטר א\'', 'קוליש אנטון', 'מחשבים 41/2', '12:35-14:10', 'Sunday', 32),
(110, '7137-32479', 'מעבדה אסמבלר', 'סמסטר א\'', 'קוליש אנטון', 'מחשבים 41/3', '11:00-12:35', 'Monday', 32),
(111, '7142-300', 'מעבדת מיקרו / אסמבלר', 'סמסטר א\'', 'קוליש אנטון', 'מחשבים 41/5 משולב', '08:00-09:30', 'Friday', 32),
(112, '7189-170', 'תכנות מתקדם בשפת JAVA', 'סמסטר א\'', 'אורנשטיין טטיאנה', 'מחשבים 41/1', '13:25-16:00', 'Tuesday', 80),
(113, '7189-170', 'תכנות מתקדם בשפת JAVA', 'סמסטר א\'', 'אורנשטיין טטיאנה', 'מחשבים 41/1', '11:00-13:20', 'Wednesday', 80),
(114, '7189-180', 'תכנות מתקדם בשפת JAVA', 'סמסטר א\'', 'קול שלי', 'מחשבים 41/2', '10:00-11:50', 'Tuesday', 96),
(115, '7189-180', 'תכנות מתקדם בשפת JAVA', 'סמסטר א\'', 'קול שלי', 'מחשבים 41/2', '12:35-15:00', 'Tuesday', 96),
(116, '7189-180', 'תכנות מתקדם בשפת JAVA', 'סמסטר א\'', 'קול שלי', 'מחשבים 41/2', '11:50-12:35', 'Wednesday', 96),
(117, '7189-32481', 'תכנות מתקדם בשפת JAVA', 'סמסטר א\'', 'דנדן סמאר', 'מחשבים 41/3', '16:10-17:45', 'Tuesday', 96),
(118, '7189-32481', 'תכנות מתקדם בשפת JAVA', 'סמסטר א\'', 'דנדן סמאר', 'מחשבים 41/3', '12:35-16:00', 'Wednesday', 96),
(119, '7189-4', 'תכנות מתקדם בשפת JAVA', 'סמסטר א\'', 'אורנשטיין טטיאנה', 'מחשבים 40/5', '17:00-18:35', 'Tuesday', 112),
(120, '7189-4', 'תכנות מתקדם בשפת JAVA', 'סמסטר א\'', 'אורנשטיין טטיאנה', 'מחשבים 40/5', '18:45-19:30', 'Tuesday', 112),
(121, '7189-4', 'תכנות מתקדם בשפת JAVA', 'סמסטר א\'', 'אורנשטיין טטיאנה', 'מחשבים 40/5', '10:30-13:45', 'Friday', 112),
(122, '7189-4', 'תכנות מתקדם בשפת JAVA', 'סמסטר א\'', ' קוליש אנטון', 'מחשבים 40/5', '17:00-18:35', 'Tuesday', 112),
(123, '7189-4', 'תכנות מתקדם בשפת JAVA', 'סמסטר א\'', ' קוליש אנטון', 'מחשבים 40/5', '18:45-19:30', 'Tuesday', 112),
(124, '7189-4', 'תכנות מתקדם בשפת JAVA', 'סמסטר א\'', ' קוליש אנטון', 'מחשבים 40/5', '10:30-13:45', 'Friday', 112),
(125, '7246-1', 'יישומים וחבילות תוכנה (תכנות מתקדם)', 'סמסטר א\'', 'צ\'רנומז יבגניה', 'מחשבים 41/1', '14:20-17:00', 'Monday', 48),
(126, '7246-2', 'יישומים וחבילות תוכנה (תכנות מתקדם)', 'סמסטר א\'', 'צ\'רנומז יבגניה', 'מחשבים 41/2', '11:00-13:20', 'Monday', 48),
(127, '7246-32483', 'יישומים וחבילות תוכנה (תכנות מתקדם)', 'סמסטר א\'', 'צ\'רנומז יבגניה', 'מחשבים 41/3', '13:25-16:00', 'Tuesday', 48),
(128, '7282-5', 'טכנולוגיות web', 'סמסטר א\'', 'דיאב עלאא אלדין', 'מחשבים 41/5 משולב', '19:35-21:10', 'Tuesday', 64),
(129, '7282-5', 'טכנולוגיות web', 'סמסטר א\'', 'דיאב עלאא אלדין', 'מחשבים 41/5 משולב', '09:40-11:15', 'Friday', 64),
(130, '7282-60', 'טכנולוגיות web', 'סמסטר א\'', 'אורנשטיין טטיאנה', 'מחשבים 41/1', '10:00-12:35', 'Sunday', 48),
(131, '7282-70', 'טכנולוגיות web', 'סמסטר א\'', 'אורנשטיין טטיאנה', 'מחשבים 41/2', '08:10-10:50', 'Wednesday', 48),
(132, '7282-71', 'טכנולוגיות web', 'סמסטר א\'', 'אורנשטיין טטיאנה', 'מחשבים 41/3', '12:35-15:05', 'Sunday', 48),
(133, '7283-32480', 'ניתוח ועצוב תוכנה מונחה עצמים', 'סמסטר א\'', 'צ\'רנומז יבגניה', 'מחשבים 41/3', '08:10-09:50', 'Sunday', 80),
(134, '7283-32480', 'ניתוח ועצוב תוכנה מונחה עצמים', 'סמסטר א\'', 'צ\'רנומז יבגניה', 'מחשבים 41/3', '13:25-16:00', 'Thursday', 80),
(135, '7283-32480', 'ניתוח ועצוב תוכנה מונחה עצמים', 'סמסטר א\'', ' קוליש אנטון', 'מחשבים 41/3', '08:10-09:50', 'Sunday', 80),
(136, '7283-32480', 'ניתוח ועצוב תוכנה מונחה עצמים', 'סמסטר א\'', ' קוליש אנטון', 'מחשבים 41/3', '13:25-16:00', 'Thursday', 80),
(137, '7283-520', 'ניתוח ועצוב תוכנה מונחה עצמים', 'סמסטר א\'', 'צ\'רנומז יבגניה', 'מחשבים 41/1', '09:00-10:50', 'Tuesday', 80),
(138, '7283-520', 'ניתוח ועצוב תוכנה מונחה עצמים', 'סמסטר א\'', 'צ\'רנומז יבגניה', 'מחשבים 41/1', '13:25-16:00', 'Thursday', 80),
(139, '7283-520', 'ניתוח ועצוב תוכנה מונחה עצמים', 'סמסטר א\'', ' קוליש אנטון', 'מחשבים 41/1', '09:00-10:50', 'Tuesday', 80),
(140, '7283-520', 'ניתוח ועצוב תוכנה מונחה עצמים', 'סמסטר א\'', ' קוליש אנטון', 'מחשבים 41/1', '13:25-16:00', 'Thursday', 80),
(141, '7283-530', 'ניתוח ועצוב תוכנה מונחה עצמים', 'סמסטר א\'', 'צ\'רנומז יבגניה', 'מחשבים 41/2', '09:00-10:50', 'Monday', 80),
(142, '7283-530', 'ניתוח ועצוב תוכנה מונחה עצמים', 'סמסטר א\'', 'צ\'רנומז יבגניה', 'מחשבים 41/2', '10:00-12:35', 'Thursday', 80),
(143, '7283-530', 'ניתוח ועצוב תוכנה מונחה עצמים', 'סמסטר א\'', ' קוליש אנטון', 'מחשבים 41/2', '09:00-10:50', 'Monday', 80),
(144, '7283-530', 'ניתוח ועצוב תוכנה מונחה עצמים', 'סמסטר א\'', ' קוליש אנטון', 'מחשבים 41/2', '10:00-12:35', 'Thursday', 80),
(145, '7289-2', 'php', 'סמסטר א\'', 'צ\'רנומז יבגניה', 'מחשבים 40/5', '17:00-19:30', 'Monday', 80),
(146, '7289-2', 'php', 'סמסטר א\'', 'צ\'רנומז יבגניה', 'מחשבים 40/5', '19:35-21:10', 'Tuesday', 80),
(147, '7302-1', 'מעבדת מחשבים', 'סמסטר א\'', 'דיאב עלאא אלדין', 'מחשבים 42/1', '12:35-15:05', 'Tuesday', 48),
(148, '7302-2', 'מעבדת מחשבים', 'סמסטר א\'', 'דיאב עלאא אלדין', 'מחשבים 42/2', '17:00-19:30', 'Tuesday', 48),
(149, '7302-3', 'מעבדת מחשבים', 'סמסטר א\'', 'דיאב עלאא אלדין', 'מחשבים 42/5 משולב', '08:00-09:30', 'Friday', 32),
(150, '7302-4', 'מעבדת מחשבים', 'סמסטר א\'', 'דיאב עלאא אלדין', 'מחשבים 42/3', '10:00-12:35', 'Tuesday', 48);

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `email` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `name` varchar(50) NOT NULL,
  `groupID` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`email`, `password`, `name`, `groupID`) VALUES
('a@g.com', '$2y$10$6jQH9EP.3tUKqFHD8pGSnes3vA565cnEaXt03Woh.VHQDZuR4OLW.', '', 2),
('c@g.com', '$2y$10$5wSk4JczHdHbFYuh5fl4tONrSDE0FIiQX8WQZzgytUdLcj46bs3Au', '', 2),
('r@g.com', '$2y$10$Yp6glA9MPd4YQ.QmcIUI6eV1jALvP/rYYBUNLOgbDulZUQXUMTcFe', '', 2),
('t@g.com', '$2y$10$d/zWZmG3ikSmYfECY7JBhOvWj8glezcvHvc7uwiyPBAZhi8oh6xyW', 'אורנשטיין טטיאנה', 3);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `classes`
--
ALTER TABLE `classes`
  ADD PRIMARY KEY (`class_id`),
  ADD UNIQUE KEY `lesson_num` (`class_code`);

--
-- Indexes for table `classes_timetables`
--
ALTER TABLE `classes_timetables`
  ADD KEY `timetable_id` (`timetable_id`),
  ADD KEY `lesson_id` (`class_id`);

--
-- Indexes for table `students`
--
ALTER TABLE `students`
  ADD PRIMARY KEY (`student_id`);

--
-- Indexes for table `students_classes`
--
ALTER TABLE `students_classes`
  ADD KEY `student_id` (`student_id`),
  ADD KEY `lesson_id` (`class_id`);

--
-- Indexes for table `students_timetables`
--
ALTER TABLE `students_timetables`
  ADD KEY `student_id` (`student_id`),
  ADD KEY `timetable_id` (`timetable_id`);

--
-- Indexes for table `timetables`
--
ALTER TABLE `timetables`
  ADD PRIMARY KEY (`timetable_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`email`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `classes`
--
ALTER TABLE `classes`
  MODIFY `class_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
--
-- AUTO_INCREMENT for table `timetables`
--
ALTER TABLE `timetables`
  MODIFY `timetable_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=151;
--
-- Constraints for dumped tables
--

--
-- Constraints for table `classes_timetables`
--
ALTER TABLE `classes_timetables`
  ADD CONSTRAINT `classes_timetables_ibfk_1` FOREIGN KEY (`timetable_id`) REFERENCES `timetables` (`timetable_id`),
  ADD CONSTRAINT `classes_timetables_ibfk_2` FOREIGN KEY (`class_id`) REFERENCES `classes` (`class_id`);

--
-- Constraints for table `students_classes`
--
ALTER TABLE `students_classes`
  ADD CONSTRAINT `students_classes_ibfk_1` FOREIGN KEY (`student_id`) REFERENCES `students` (`student_id`),
  ADD CONSTRAINT `students_classes_ibfk_2` FOREIGN KEY (`class_id`) REFERENCES `classes` (`class_id`);

--
-- Constraints for table `students_timetables`
--
ALTER TABLE `students_timetables`
  ADD CONSTRAINT `students_timetables_ibfk_1` FOREIGN KEY (`student_id`) REFERENCES `students` (`student_id`),
  ADD CONSTRAINT `students_timetables_ibfk_2` FOREIGN KEY (`timetable_id`) REFERENCES `timetables` (`timetable_id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
